import json

id_SubFed = ['Республика Башкортостан',
             'Республика Марий Эл',
             'Республика Мордовия',
             'Республика Татарстан',
             'Удмуртская Республика',
             'Чувашская Республика',
             'Пермский край',
             'Кировская область',
             'Нижегородская область',
             'Оренбургская область',
             'Пензенская область',
             'Самарская область',
             'Саратовская область',
             'Ульяновская область']

Amount_GS = {
    'sheet' : '1.1. Кол-во ГС',
    'iloc_rows' : [6,20],
    'iloc_columns' : [6, 18],
    'drop_column' : [9, 13, 17],
    'm_id_lists' : [
        id_SubFed,
        [
        'Численность государственных должностей субъекта Российской Федерации',
        'Численность должностей государственной гражданской службы',
        'Численность должностей, не отнесенных к должностям государственной гражданской службы'
        ],
        [
        'Всего',
        'замещено',
        'количество лиц, находящихся в отпуске по уходу за ребенком'
        ]
        ],
    'm_id_names' : ['id_SubFed', 'group', 'status'],
    'csv_path' : 'CSVs/Amount_GS.csv',
}

Amount_MS = {
    'sheet' : '1.2. Кол-во МС',
    'iloc_rows' : [6,20],
    'iloc_columns' : [6, 14],
    'drop_column' : [9, 13],
    'm_id_lists' : [
        id_SubFed,
        [
            'Численность должностей муниципальной службы',
            'Численность должностей, не отнесенных к должностям муниципальной службы'
        ],
        [
        'Всего',
        'замещено',
        'количество лиц, находящихся в отпуске по уходу за ребенком'
        ]
        ],
    'm_id_names' : ['id_SubFed', 'group', 'status'],
    'csv_path' : 'CSVs/Amount_MS.csv',
}

all_settings = {
    'Amount_GS' : Amount_GS,
    'Amount_MS' : Amount_MS
}

json_string = json.dumps(all_settings, ensure_ascii=False, indent=4)
print(json_string)
with open("all_settings.json", "w", encoding="utf-8") as file:
    file.write(json_string)